# Конфигурация бота
# TOKEN = '8390538420:AAHywQUJxxBQrs_ZsE32RlatCiDvR2-WPqs' #TestMag

TOKEN = '8358310264:AAFXG4TWA6w3xMrIQr-jvmR4RVyrC3KzttI' #Bekzhan_DS

# Глобальные переменные (лучше заменить на Redis в будущем)
active_tasks = {}
zav_on_shift = []
task_assignments = {}  # {task_num: кол-во уже выданных}
assignments = []

# Константы
SHIFT_MAP = {'День': 'day', 'Ночь': 'night'}

#ZS_GROUP_CHAT_ID = -1003089690648 # ЧАТ ТЕСТОВЫЙ
ZS_GROUP_CHAT_ID = -1003028566040 # Bekzhan_DS
#ZS_GROUP_CHAT_ID = -1002917837249  # ОСНОВНОЙ ЧАТ КЕНМАРТА

MERCHANT_ID = 7001  # Склад/мерчант по умолчанию

#ID TOPICS FOR CITYBOT
# TOPIC_IDS = {
#     'Бакалея': 2,
#     'Напитки': 8,
#     'Химия': 6,
#     'Соф': 4,
#     'Молочка': 16,
#     'Гастрономия': 14,
#     'Холодная зона': 12,
#     'Сухая зона': 10,
#     'Заморозка': 18
# }


#ID TOPICS FOR KenMart
# TOPIC_IDS = {
#     'Бакалея': 9,
#     'Напитки': 10,
#     'Химия': 2,
#     'Соф': 11,
#     'Молочка': 12,
#     'Гастрономия': 13,
#     'Холодная зона': 14,
#     'Сухая зона': 15,
#     'Заморозка': 16
# }



# TOPIC_IDS FOR TestMagBot
# TOPIC_IDS = {
#     'Бакалея': 65,
#     'Напитки': 69,
#     'Химия': 67,
#     'Соф': 77,
#     'Молочка': 79,
#     'Гастрономия': 75,
#     'Холодная зона': 73,
#     'Сухая зона': 71,
#     'Заморозка': 81
# }

# TOPIC_IDS FOR Bekzhan_DS
TOPIC_IDS = {
    'Бакалея': 2,
    'Напитки': 4,
    'Химия': 13,
    'Соф': 8,
    'Молочка': 6,
    'Гастрономия': 11,
    'Холодная зона': 17,
    'Сухая зона': 15,
    'Заморозка': 19
}

